---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoSlopeGlazing
source: html/00feb0be-205e-2c2d-abdf-939d3a672fb5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillNoSlopeGlazing Property

Could not change type due to highlighted infilling element. 'Sloped glazing' infills are not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId InfillNoSlopeGlazing { get; }
```